In [111]:
from sqlalchemy import create_engine
import os
import mysql.connector
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [112]:
User = os.environ.get('DB_User')
Password = os.environ.get('DB_PASS')
#def mysql_connection(host, user, passwd, database=None):
#    engine = create_engine(f'mysql+pymysql://{user}:{passwd}@{host}/{database}')
#    return engine.connect()

In [113]:
#connection = mysql_connection('localhost', 'root', 'mysql123', 'dadosaocubo')
#connection = mysql_connection('40b8f30251.nxcli.io', 'a4f2b49a_padawan', 'KaratFlanksUgliedSpinal', 'a4f2b49a_sample_database')

connection = mysql.connector.connect(host='40b8f30251.nxcli.io',
                                     database='a4f2b49a_sample_database',
                                     user='a4f2b49a_padawan',
                                     password= 'KaratFlanksUgliedSpinal')

In [114]:
connection

In [115]:
raw_data_tables = pd.read_sql_query('show tables FROM a4f2b49a_sample_database ', connection)

In [106]:
raw_data_tables

  Tables_in_a4f2b49a_sample_database
0                           raw_data

In [116]:
raw_data_table = pd.read_sql_query('SELECT * FROM raw_data ', connection)
raw_data_table

C:\ProgramData\Anaconda3\lib\site-packages\pandas\io\sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

           datahora_acesso  clientes_id modalidade   rake
0      2021-03-15T17:00:00         9467    Torneio   1.00
1      2023-04-11T07:57:51         4683  Cash Game  74.05
2      2022-01-19T11:00:00         2651    Torneio   6.00
3      2023-03-12T13:54:40         5300  Cash Game  10.10
4      2022-06-07T15:52:24         3711  Cash Game   7.65
...                    ...          ...        ...    ...
99995  2021-09-25T13:27:00        37868  Cash Game   6.06
99996  2023-05-05T22:01:48       117899  Cash Game   0.55
99997  2022-04-11T18:00:00        56711    Torneio   4.50
99998  2022-08-16T11:39:02         9777  Cash Game   6.15
99999  2023-03-01T20:00:00        64800    Torneio   0.10

[100000 rows x 4 columns]